## TF plan

```hcl
╰─❯ leverage terraform plan


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group_membership.default["ariel.jalil_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_group_membership.default["federico.losso_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_user.default["ariel.jalil"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Ariel Jalil"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "ariel.jalil@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "ariel.jalil@binbash.com.ar"
        }

      + name {
          + family_name = "Jalil"
          + given_name  = "Ariel"
        }
    }

  # aws_identitystore_user.default["federico.losso"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Federico Losso"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "federico.losso@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "federico.losso@binbash.com.ar"
        }

      + name {
          + family_name = "Losso"
          + given_name  = "Federico"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```